In [4]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

In [4]:
s=Series(data=np.random.randint(0,100,5),index=list('abcde'),name="成绩表")
s

a    90
b    55
c    69
d    21
e    60
Name: 成绩表, dtype: int32

In [7]:
my_dic={"a":50,"b":60}
b=Series(my_dic,name="成绩表")
b

a    50
b    60
Name: 成绩表, dtype: int64

In [11]:
# 使用显示索引两种方法取值
mlist=['a','b']
s['a']
s[1]
s[mlist] # 取出来还是一个Series对象

a    90
b    55
Name: 成绩表, dtype: int32

In [12]:
# 间隔1个元素取数 
s[::2]

a    90
c    69
e    60
Name: 成绩表, dtype: int32

In [13]:
# 间隔反转
s[::-2]

e    60
c    69
a    90
Name: 成绩表, dtype: int32

In [14]:
s[0:3]

a    90
b    55
c    69
Name: 成绩表, dtype: int32

In [15]:
s[-1]

60

In [16]:
s

a    90
b    55
c    69
d    21
e    60
Name: 成绩表, dtype: int32

In [18]:
# 这个series其实就是一个map  map.keys
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [19]:
# 
s.values

array([90, 55, 69, 21, 60])

In [21]:
# 展示前几个 就相当于sql 中的limit
s.head(7)

a    90
b    55
c    69
d    21
e    60
Name: 成绩表, dtype: int32

In [23]:
s.tail(2)

d    21
e    60
Name: 成绩表, dtype: int32

In [30]:
s['a']=np.NaN
s

a     NaN
b    55.0
c    69.0
d    21.0
e    60.0
Name: 成绩表, dtype: float64

In [33]:
# 找出为NaN的值
cond=s.isnull()
s[cond]

a   NaN
Name: 成绩表, dtype: float64

In [35]:
# 筛选空数据
s.notnull()

a    False
b     True
c     True
d     True
e     True
Name: 成绩表, dtype: bool

In [36]:
s.name

'成绩表'

In [37]:
s+1000

a       NaN
b    1055.0
c    1069.0
d    1021.0
e    1060.0
Name: 成绩表, dtype: float64

In [40]:
# 
s.add(100,fill_value=0)

a    100.0
b    155.0
c    169.0
d    121.0
e    160.0
Name: 成绩表, dtype: float64

In [39]:
s.add_prefix('id_')

id_a     NaN
id_b    55.0
id_c    69.0
id_d    21.0
id_e    60.0
Name: 成绩表, dtype: float64

In [42]:
s.keys()

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [44]:
# 每个值出现的次数
s.value_counts()

60.0    1
21.0    1
69.0    1
55.0    1
Name: 成绩表, dtype: int64

In [45]:
s.max()

69.0

In [46]:
li = ['xxxx.mp3','sfsa.wav','xfjs.mp3','fssfs.als','sfsjeio.ps','sfjsljfs.als']

In [49]:
# 对各种后缀出现的次数进行统计 取前两个最多的
Series(x.split('.')[-1] for x in li).value_counts().head(2)

mp3    2
als    2
dtype: int64

In [51]:
s.abs()

a     NaN
b    55.0
c    69.0
d    21.0
e    60.0
Name: 成绩表, dtype: float64

In [52]:
df = DataFrame(data = {'Python':np.random.randint(0,150,size =5 ),
                       'Math':np.random.randint(0,150,size = 5),
                       'En':np.random.randint(0,150,size = 5)},
               index = list('ABCDE'))
df

   Python  Math   En
A     109    82  133
B      96    66   62
C      59    28  124
D     120    88   49
E      85   124  136

In [63]:
df2=DataFrame(data=np.random.randint(0,100,size=(10,5)),
              index=list('ABCDEFHIJK'),
              columns=['math','en','python','java','scala']
             )
df2

   math  en  python  java  scala
A    21  76      12    47     14
B    44  37      16    86     62
C     2  45      84    67     98
D    67  15      69    15      2
E    46  40       3    68     12
F    41  56      77    49     40
H    97  91      84    93     20
I    25  14      80    46     88
J    86  32      36    31     54
K    12  42      23     0     44

In [64]:
df2.to_csv('./a.txt')

In [65]:
df2.to_excel('./a.xlsx')

In [75]:
df3=pd.read_csv('./a.txt')
df4=df3.rename(mapper={'Unnamed: 0':'index'},axis=1)
df4

  index  math  en  python  java  scala
0     A    21  76      12    47     14
1     B    44  37      16    86     62
2     C     2  45      84    67     98
3     D    67  15      69    15      2
4     E    46  40       3    68     12
5     F    41  56      77    49     40
6     H    97  91      84    93     20
7     I    25  14      80    46     88
8     J    86  32      36    31     54
9     K    12  42      23     0     44

In [69]:
pd.read_csv('./a.txt')

  Unnamed: 0  math  en  python  java  scala
0          A    21  76      12    47     14
1          B    44  37      16    86     62
2          C     2  45      84    67     98
3          D    67  15      69    15      2
4          E    46  40       3    68     12
5          F    41  56      77    49     40
6          H    97  91      84    93     20
7          I    25  14      80    46     88
8          J    86  32      36    31     54
9          K    12  42      23     0     44

In [76]:
# 获取某一列的全部样本
df4.java

0    47
1    86
2    67
3    15
4    68
5    49
6    93
7    46
8    31
9     0
Name: java, dtype: int64

In [78]:
df4[['java','math']]

   java  math
0    47    21
1    86    44
2    67     2
3    15    67
4    68    46
5    49    41
6    93    97
7    46    25
8    31    86
9     0    12

In [83]:
#
df.loc['A']

Python    109
Math       82
En        133
Name: A, dtype: int32

In [84]:
df.loc[['A','B']]

   Python  Math   En
A     109    82  133
B      96    66   62

In [86]:
df.iloc[[0,1]]

   Python  Math   En
A     109    82  133
B      96    66   62

In [88]:
df['Math']['B']

66

In [90]:
df.any()

Python    True
Math      True
En        True
dtype: bool

In [89]:
df.loc['A']['Math']

82

In [91]:
df.all()

Python    True
Math      True
En        True
dtype: bool

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Python  5 non-null      int32
 1   Math    5 non-null      int32
 2   En      5 non-null      int32
dtypes: int32(3)
memory usage: 260.0+ bytes

In [7]:
df=DataFrame(np.random.randint(0,150,size=(150,3)),columns=['Python','Math','En'])
df

     Python  Math   En
0        38   138  149
1        31    70   27
2        60   105   42
3        71     6   72
4       144   106   64
..      ...   ...  ...
145       5    24   86
146     126    89   78
147      93   120   82
148      43    61   21
149      35    34   98

[150 rows x 3 columns]

In [8]:
for i in range(15):
    index=np.random.randint(0,150,size=1)[0]
    column=np.random.randint(0,3,size=1)[0]
    df.iloc[index,column]=None
df

     Python   Math     En
0      38.0  138.0  149.0
1      31.0   70.0   27.0
2      60.0  105.0   42.0
3      71.0    6.0   72.0
4     144.0  106.0   64.0
..      ...    ...    ...
145     5.0   24.0   86.0
146   126.0   89.0    NaN
147    93.0  120.0   82.0
148     NaN   61.0    NaN
149    35.0   34.0    NaN

[150 rows x 3 columns]

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Python  146 non-null    float64
 1   Math    146 non-null    float64
 2   En      143 non-null    float64
dtypes: float64(3)
memory usage: 3.6 KB

In [13]:

cond=df.isnull().any(axis=1)
df[cond]

     Python   Math     En
15      NaN   49.0  104.0
45     24.0    NaN   94.0
46      NaN    NaN   30.0
51    149.0    6.0    NaN
54     76.0    NaN   28.0
70    108.0    NaN   10.0
85     52.0  119.0    NaN
90     92.0  143.0    NaN
129   125.0   92.0    NaN
138     NaN   70.0   50.0
146   126.0   89.0    NaN
148     NaN   61.0    NaN
149    35.0   34.0    NaN

In [15]:
# 这样就可以过滤空值
cond1=df.notnull().all(axis=1)
df[cond1]

     Python   Math     En
0      38.0  138.0  149.0
1      31.0   70.0   27.0
2      60.0  105.0   42.0
3      71.0    6.0   72.0
4     144.0  106.0   64.0
..      ...    ...    ...
142   121.0    2.0   45.0
143    83.0   41.0  136.0
144   109.0    8.0   99.0
145     5.0   24.0   86.0
147    93.0  120.0   82.0

[137 rows x 3 columns]

In [16]:
df.dropna()

     Python   Math     En
0      38.0  138.0  149.0
1      31.0   70.0   27.0
2      60.0  105.0   42.0
3      71.0    6.0   72.0
4     144.0  106.0   64.0
..      ...    ...    ...
142   121.0    2.0   45.0
143    83.0   41.0  136.0
144   109.0    8.0   99.0
145     5.0   24.0   86.0
147    93.0  120.0   82.0

[137 rows x 3 columns]

In [20]:
df.drop(labels=['En'],axis=1)

     Python   Math
0      38.0  138.0
1      31.0   70.0
2      60.0  105.0
3      71.0    6.0
4     144.0  106.0
..      ...    ...
145     5.0   24.0
146   126.0   89.0
147    93.0  120.0
148     NaN   61.0
149    35.0   34.0

[150 rows x 2 columns]

In [23]:
cond=df.isnull().any(axis=1)
index=df[cond].index
index

Int64Index([15, 45, 46, 51, 54, 70, 85, 90, 129, 138, 146, 148, 149], dtype='int64')

In [24]:
df.drop(labels=index)

     Python   Math     En
0      38.0  138.0  149.0
1      31.0   70.0   27.0
2      60.0  105.0   42.0
3      71.0    6.0   72.0
4     144.0  106.0   64.0
..      ...    ...    ...
142   121.0    2.0   45.0
143    83.0   41.0  136.0
144   109.0    8.0   99.0
145     5.0   24.0   86.0
147    93.0  120.0   82.0

[137 rows x 3 columns]

In [30]:
cond=df.mean(axis=1)<60
index=df[cond].index
df.drop(labels=index)

     Python   Math     En
0      38.0  138.0  149.0
2      60.0  105.0   42.0
4     144.0  106.0   64.0
5      43.0   97.0  149.0
6     112.0  102.0  128.0
..      ...    ...    ...
143    83.0   41.0  136.0
144   109.0    8.0   99.0
146   126.0   89.0    NaN
147    93.0  120.0   82.0
148     NaN   61.0    NaN

[101 rows x 3 columns]

In [33]:
cond1=df.mean(axis=1)<60
cond2=df.mean(axis=1)>100
cond=cond1|cond2
df[cond]

     Python   Math     En
0      38.0  138.0  149.0
1      31.0   70.0   27.0
3      71.0    6.0   72.0
4     144.0  106.0   64.0
6     112.0  102.0  128.0
..      ...    ...    ...
137    50.0   56.0   17.0
142   121.0    2.0   45.0
145     5.0   24.0   86.0
146   126.0   89.0    NaN
149    35.0   34.0    NaN

[74 rows x 3 columns]

In [34]:
df = DataFrame(np.random.randint(0,150,size = (5,3)),columns=['Python','En','Math'])
df

   Python   En  Math
0      11   79   123
1       6  120   129
2     147    0    44
3      21   81    48
4      80   74   141

In [35]:
df['Python'][0] = None

df['En'][3] = np.NaN

<ipython-input-35-106bf2f5ded7>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['En'][3] = np.NaN
D:\soft\anaconda\lib\site-packages\pandas\core\indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [36]:
df

   Python     En  Math
0     NaN   79.0   123
1     6.0  120.0   129
2   147.0    0.0    44
3    21.0    NaN    48
4    80.0   74.0   141

In [37]:
np.NaN+10

nan

In [38]:
None+10

TypeError: unsupported operand type(s) for +: 'NoneType' and 'int'